#ifndef __ECP_OPERATION_H__
#define	__ECP_OPERATION_H__

#include "SysConfigProfile.h"
#include "ecpDefine.h"

/********************************************************加法运算 *************************************************************/
/*****************************************************************************************************************************/
#if BOOT__CODE_CHECK__FOR_TEST
	extern u16 U8_A_U8(u8 a, u8 b);
	extern u32 U8_A_U16(u8 a, u16 b);
	extern u32 U8_A_U32(u8 a, u32 b);

	extern u32 U16_A_U8(u16 a, u8 b);
	extern u32 U32_A_U8(u32 a, u8 b);
	extern u32 U32_A_U16(u32 a, u16 b);

	extern u32 U16_A_U16(u16 a, u16 b);
	extern u32 U16_A_U32(u16 a, u32 b);
	extern u32 U32_A_U32(u32 a, u32 b);

	extern u8  U8_INC(u8 a);
	extern u16 U16_INC(u16 a);
	extern u32 U32_INC(u32 a);

	extern PX8 PX8_A_U8(PX8 a, u8 b);
	extern PX8 PX8_A_U16(PX8 a, u16 b);
	extern PX8 PX8_A_CONST(PX8 a, u32 b);
	extern PX8 PX8_INC(PX8 a);

	extern PR8 PR8_A_U8(PR8 a, u8 b);
	extern PR8 PR8_A_U16(PR8 a, u16 b);
	extern PR8 PR8_A_CONST(PR8 a, u32 b);
	extern PR8 PR8_INC(PR8 a);

	extern PN8 PN8_A_U8(PN8 a, u8 b);
	extern PN8 PN8_A_U16(PN8 a, u16 b);
	extern PN8 PN8_A_U32(PN8 a, u32 b);
	extern PN8 PN8_A_CONST(PN8 a, u32 b);
	extern PN8 PN8_INC(PN8 a);

	extern PC8 PC8_A_U8(PC8 a, u8 b);
	extern PC8 PC8_A_U16(PC8 a, u16 b);
	extern PC8 PC8_A_U32(PC8 a, u32 b);
	extern PC8 PC8_A_CONST(PC8 a, u32 b);
	extern PC8 PC8_INC(PC8 a);

	extern PF8 PF8_A_U8(PF8 a, u8 b);
	extern PF8 PF8_A_U16(PF8 a, u16 b);
	extern PF8 PF8_A_U32(PF8 a, u32 b);
	extern PF8 PF8_A_CONST(PF8 a, u32 b);
	extern PF8 PF8_INC(PF8 a);

	extern PM8 PM8_A_U8(PM8 a, u8 b);
	extern PM8 PM8_A_U16(PM8 a, u16 b);
	extern PM8 PM8_A_U32(PM8 a, u32 b);
	extern PM8 PM8_A_CONST(PM8 a, u32 b);
	extern PM8 PM8_INC(PM8 a);
#else
	#define	U8_A_U8(a, b)					((u8)(a) + (u8)(b))
	#define	U8_A_U16(a, b)					((u8)(a) + (u16)(b))
	#define	U8_A_U32(a, b)					((u8)(a) + (u32)(b))

	#define	U16_A_U8(a, b)					((u16)(a) + (u8)(b))
	#define	U32_A_U8(a, b)					((u32)(a) + (u8)(b))
	#define	U32_A_U16(a, b)					((u32)(a) + (u16)(b))

	#define	U16_A_U16(a, b)					((u16)(a) + (u16)(b))
	#define	U16_A_U32(a, b)					((u16)(a) + (u32)(b))
	#define	U32_A_U32(a, b)					((u32)(a) + (u32)(b))

	#define U8_INC(a)						((u8)(a) ++)
	#define U16_INC(a)						((u16)(a) ++)
	#define U32_INC(a)						((u32)(a) ++)

	#define	ecpHuge_Add(a, la, b, lb)

	#define PX8_A_U8(a, b)					(((PX8)(a) + (u8)(b)))
	#define PX8_A_U16(a, b)					(((PX8)(a) + (u16)(b)))
	#define PX8_A_CONST(a, b)				(((PX8)(a) + (b)))
	#define PX8_INC(a)						(a ++)

	#define PR8_A_U8(a, b)					((a) + (u8)(b))
	#define PR8_A_U16(a, b)					((a) + (u16)(b))
	#define PR8_A_CONST(a, b)				((a) + (b))
	#define PR8_INC(a)						(a++)

	#define PN8_A_U8(a, b)					((a) + (u8)(b))
	#define PN8_A_U16(a, b)					((a) + (u16)(b))
	#define PN8_A_U32(a, b)					((a) + (u32)(b))
	#define PN8_A_CONST(a, b)				((a) + (b))
	#define PN8_INC(a)						(a++)

	#define PC8_A_U8(a, b)					((a) + (u8)(b))
	#define PC8_A_U16(a, b)					((a) + (u16)(b))
	#define PC8_A_U32(a, b)					((a) + (u32)(b))
	#define PC8_A_CONST(a, b)				((a) + (b))
	#define PC8_INC(a)						(a++)

	#define PF8_A_U8(a, b)					((a) + (u8)(b))
	#define PF8_A_U16(a, b)					((a) + (u16)(b))
	#define PF8_A_U32(a, b)					((a) + (u32)(b))
	#define PF8_A_CONST(a, b)				((a) + (u32)(b))
	#define PF8_INC(a)						(a++)

	#define PM8_A_U8(a, b)					((a) + (u8)(b))
	#define PM8_A_U16(a, b)					((a) + (u16)(b))
	#define PM8_A_U32(a, b)					((a) + (u32)(b))
	#define PM8_A_CONST(a, b)				((a) + (b))
	#define PM8_INC(a)						(a ++)
#endif

/*****************************************************************************************************************************/
/*****************************************************************************************************************************/

/********************************************************减法运算*************************************************************/
/*****************************************************************************************************************************/
#if BOOT__CODE_CHECK__FOR_TEST
	extern u8 U8_S_U8(u8 a, u8 b);
	extern u16 U16_S_U8(u16 a, u8 b);
	extern u16 U16_S_U16(u16 a, u16 b);
	extern u32 U32_S_U8(u32 a, u8 b);
	extern u32 U32_S_U16(u32 a, u16 b);
	extern u32 U32_S_U32(u32 a, u32 b);

	extern u8 U8_DEC(u8 a);
	extern u16 U16_DEC(u16 a);
	extern u32 U32_DEC(u32 a);

	extern PX8 PX8_S_U8(PX8 a, u8 b);
	extern PX8 PX8_S_U16(PX8 a, u16 b);
	extern PX8 PX8_S_CONST(PX8 a, u32 b);
	extern PX8 PX8_DEC(PX8 a);

	extern PR8 PR8_S_U8(PR8 a, u8 b);
	extern PR8 PR8_S_U16(PR8 a, u16 b);
	extern PR8 PR8_S_CONST(PR8 a, u32 b);
	extern PR8 PR8_DEC(PR8 a);

	extern PN8 PN8_S_U8(PN8 a, u8 b);
	extern PN8 PN8_S_U16(PN8 a, u16 b);
	extern PN8 PN8_S_U32(PN8 a, u32 b);
	extern PN8 PN8_S_CONST(PN8 a, u32 b);
	extern PN8 PN8_DEC(PN8 a);

	extern PC8 PC8_S_U8(PC8 a, u8 b);
	extern PC8 PC8_S_U16(PC8 a, u16 b);
	extern PC8 PC8_S_U32(PC8 a, u32 b);
	extern PC8 PC8_S_CONST(PC8 a, u32 b);
	extern PC8 PC8_DEC(PC8 a);

	extern PF8 PF8_S_U8(PF8 a, u8 b);
	extern PF8 PF8_S_U16(PF8 a, u16 b);
	extern PF8 PF8_S_U32(PF8 a, u32 b);
	extern PF8 PF8_S_CONST(PF8 a, u32 b);
	extern PF8 PF8_DEC(PF8 a);

	extern PM8 PM8_S_U8(PM8 a, u8 b);
	extern PM8 PM8_S_U16(PM8 a, u16 b);
	extern PM8 PM8_S_U32(PM8 a, u32 b);
	extern PM8 PM8_S_CONST(PM8 a, u32 b);
	extern PM8 PM8_DEC(PM8 a);
#else
	#define U8_S_U8(a, b)					((u8)(a) - (u8)(b))
	#define U16_S_U8(a, b)					((u16)(a) - (u16)(b))
	#define U16_S_U16(a, b)					((u16)(a) - (u16)(b))
	#define U32_S_U8(a, b)					((u32)(a) - (u32)(b))
	#define U32_S_U16(a, b)					((u32)(a) - (u32)(b))
	#define U32_S_U32(a, b)					((u32)(a) - (u32)(b))

	#define U8_DEC(a)						((u8)(a) --)
	#define U16_DEC(a)						((u16)(a) --)
	#define U32_DEC(a)						((u32)(a) --)

	#define ecpHuge_Sub(a, la, b, lb)

	#define PX8_S_U8(a, b)					((a) - (u8)(b))
	#define PX8_S_U16(a, b)					((a) - (u16)(b))
	#define PX8_S_CONST(a, b)				((a) - (b))
	#define PX8_DEC(a)						(a --)

	#define PR8_S_U8(a, b)					((a) - (u8)(b))
	#define PR8_S_U16(a, b)					((a) - (u16)(b))
	#define PR8_S_CONST(a, b)				((a) - (b))
	#define PR8_DEC(a)						(a --)

	#define PN8_S_U8(a, b)					((a) - (u8)(b))
	#define PN8_S_U16(a, b)					((a) - (u16)(b))
	#define PN8_S_U32(a, b)					((a) - (u32)(b))
	#define PN8_S_CONST(a, b)				((a) - (b))
	#define PN8_DEC(a)						(a --)

	#define PC8_S_U8(a, b)					((a) - (u8)(b))
	#define PC8_S_U16(a, b)					((a) - (u16)(b))
	#define PC8_S_U32(a, b)					((a) - (u32)(b))
	#define PC8_S_CONST(a, b)				((a) - (b))
	#define PC8_DEC(a)						(a --)

	#define PF8_S_U8(a, b)					((a) - (u8)(b))
	#define PF8_S_U16(a, b)					((a) - (u16)(b))
	#define PF8_S_U32(a, b)					((a) - (u32)(b))
	#define PF8_S_CONST(a, b)				((a) - (b))
	#define PF8_DEC(a)						(a --)
	#define PM8_S_U8(a, b)					((a) - (u8)(b))
	#define PM8_S_U16(a, b)					((a) - (u16)(b))
	#define PM8_S_U32(a, b)					((a) - (u32)(b))
	#define PM8_S_CONST(a, b)				((a) - (b))
	#define PM8_DEC(a)						(a --)
#endif

/*****************************************************************************************************************************/
/*****************************************************************************************************************************/

/********************************************************乘法运算 *************************************************************/
/*****************************************************************************************************************************/
#if BOOT__CODE_CHECK__FOR_TEST
	extern u16 U8_M_U8(u8 a, u8 b);
	extern u32 U8_M_U16(u8 a, u16 b);
	extern u32 U8_M_U32(u8 a, u32 b);
	extern u32 U16_M_U16(u16 a, u16 b);
	extern u32 U16_M_U32(u16 a, u32 b);
	extern u32 U32_M_U32(u32 a, u32 b);
#else
	#define	U8_M_U8(a, b)					((u8)(a) * (u8)(b))
	#define	U8_M_U16(a, b)					((u8)(a) * (u16)(b))
	#define	U8_M_U32(a, b)					((u8)(a) * (u32)(b))
	#define	U16_M_U16(a, b)					((u16)(a) * (u16)(b))
	#define	U16_M_U32(a, b)					((u16)(a) * (u32)(b))
	#define U32_M_U32(a, b)					((u32)(a) * (u32)(b))

	#define ecpHuge_Mul(a, la, b, lb)
#endif
/*****************************************************************************************************************************/
/*****************************************************************************************************************************/

/********************************************************除法运算 *************************************************************/
/*****************************************************************************************************************************/
#if BOOT__CODE_CHECK__FOR_TEST
	extern u8  U8_D_U8(u8 a, u8 b);
	extern u16 U16_D_U8(u16 a, u8 b);
	extern u16 U16_D_U16(u16 a, u16 b);
	extern u32 U32_D_U8(u32 a, u8 b);
	extern u16 U32_D_U16(u32 a, u16 b);
	extern u32 U32_D_U32(u32 a, u32 b);
#else
	#define U8_D_U8(a, b)					((u8)(a) / (u8)(b))
	#define U16_D_U8(a, b)					((u16)(a) / (u8)(b))
	#define U16_D_U16(a, b)					((u16)(a) / (u16)(b))
	#define U32_D_U8(a, b)					((u32)(a) / (u8)(b))
	#define U32_D_U16(a, b)					((u32)(a) / (u16)(b))
	#define U32_D_U32(a, b)					((u32)(a) / (u32)(b))

	#define ecpHuge_Div(a, la, b, lb)
#endif
/*****************************************************************************************************************************/
/*****************************************************************************************************************************/

/********************************************************求余运算 *************************************************************/
/*****************************************************************************************************************************/
#if BOOT__CODE_CHECK__FOR_TEST
	extern u8  U8_R_U8(u8 a, u8 b);
	extern u16 U16_R_U8(u16 a, u8 b);
	extern u16 U16_R_U16(u16 a, u16 b);
	extern u32 U32_R_U8(u32 a, u8 b);
	extern u32 U32_R_U16(u32 a, u16 b);
	extern u32 U32_R_U32(u32 a, u32 b);
#else
	#define U8_R_U8(a, b)					((u8)(a) % (u8)(b))
	#define U16_R_U8(a, b)					((u16)(a) % (u8)(b))
	#define U16_R_U16(a, b)					((u16)(a) % (u16)(b))
	#define U32_R_U8(a, b)					((u32)(a) % (u8)(b))
	#define U32_R_U16(a, b)					((u32)(a) % (u16)(b))
	#define U32_R_U32(a, b)					((u32)(a) % (u32)(b))
#endif
/*****************************************************************************************************************************/
/*****************************************************************************************************************************/

/********************************************************与运算***************************************************************/
/*****************************************************************************************************************************/
#if BOOT__CODE_CHECK__FOR_TEST
	extern u8 U8_AND_U8(u8 a, u8 b);
	extern u16 U16_AND_U16(u16 a, u16 b);
	extern u32 U32_AND_U32(u32 a, u32 b);
#else
	#define U8_AND_U8(a, b)					(u8)((u8)(a) & (u8)(b))
	#define U16_AND_U16(a, b)				(u16)((u16)(a) & (u16)(b))
	#define U32_AND_U32(a, b)				(u32)((u32)(a) & (u32)(b))
#endif
/*****************************************************************************************************************************/
/*****************************************************************************************************************************/


/********************************************************或运算***************************************************************/
/*****************************************************************************************************************************/
#if BOOT__CODE_CHECK__FOR_TEST
	extern u8  U8_OR_U8(u8 a, u8 b);
	extern u16 U16_OR_U16(u16 a, u16 b);
	extern u32 U32_OR_U32(u32 a, u32 b);
#else
	#define U8_OR_U8(a, b)					(u8)((u8)(a) | (u8)(b))
	#define U16_OR_U16(a, b)				(u16)((u16)(a) | (u16)(b))
	#define U32_OR_U32(a, b)				(u32)((u32)(a) | (u32)(b))
#endif
/*****************************************************************************************************************************/
/*****************************************************************************************************************************/

/********************************************************异或运算*************************************************************/
/*****************************************************************************************************************************/
#if BOOT__CODE_CHECK__FOR_TEST
	extern u8  U8_XOR_U8(u8 a, u8 b);
	extern u16 U16_XOR_U16(u16 a, u16 b);
	extern u32 U32_XOR_U32(u32 a, u32 b);
#else
	#define U8_XOR_U8(a, b)					(u8)((u8)(a) ^ (u8)(b))
	#define U16_XOR_U16(a, b)				(u16)((u16)(a) ^ (u16)(b))
	#define U32_XOR_U32(a, b)				(u32)((u32)(a) ^ (u32)(b))
#endif
/*****************************************************************************************************************************/
/*****************************************************************************************************************************/

/********************************************************左移运算*************************************************************/
/*****************************************************************************************************************************/
#if BOOT__CODE_CHECK__FOR_TEST
	extern u8 U8_SHL_U8(u8 a, u8 b);
	extern u16 U16_SHL_U8(u16 a, u8 b);
	extern u16 U16_SHL_U16(u16 a, u16 b);
	extern u32 U32_SHL_U8(u32 a, u8 b);
	extern u32 U32_SHL_U16(u32 a, u16 b);
	extern u32 U32_SHL_U32(u32 a, u32 b);
#else
	#define U8_SHL_U8(a, b)					(u8)((u8)(a) << (u8)(b))
	#define U16_SHL_U8(a, b)				(u16)((u16)(a) << (u8)(b))
	#define U16_SHL_U16(a, b)				(u16)((u16)(a) << (u16)(b))
	#define U32_SHL_U8(a, b)				(u32)((u32)(a) << (u8)(b))
	#define U32_SHL_U16(a, b)				(u32)((u32)(a) << (u16)(b))
	#define U32_SHL_U32(a, b)				(u32)((u32)(a) << (u32)(b))
#endif
/*****************************************************************************************************************************/
/*****************************************************************************************************************************/

/********************************************************右移运算*************************************************************/
/*****************************************************************************************************************************/
#if BOOT__CODE_CHECK__FOR_TEST
	extern u8 U8_SHR_U8(u8 a, u8 b);
	extern u16 U16_SHR_U8(u16 a, u8 b);
	extern u16 U16_SHR_U16(u16 a, u16 b);
	extern u32 U32_SHR_U8(u32 a, u8 b);
	extern u32 U32_SHR_U16(u32 a, u16 b);
	extern u32 U32_SHR_U32(u32 a, u32 b);
#else
	#define U8_SHR_U8(a, b)					(u8)((u8)(a) >> (u8)(b))
	#define U16_SHR_U8(a, b)				(u16)((u16)(a) >> (u8)(b))
	#define U16_SHR_U16(a, b)				(u16)((u16)(a) >> (u16)(b))
	#define U32_SHR_U8(a, b)				(u32)((u32)(a) >> (u8)(b))
	#define U32_SHR_U16(a, b)				(u32)((u32)(a) >> (u16)(b))
	#define U32_SHR_U32(a, b)				(u32)((u32)(a) >> (u32)(b))
#endif
/*****************************************************************************************************************************/
/*****************************************************************************************************************************/

/********************************************************数据取反操作**********************************************************/
#if BOOT__CODE_CHECK__FOR_TEST
	extern u8 U8_INV(u8 a);
	extern u16 U16_INV(u16 a);
	extern u32 U32_INV(u32 a);
#else
	#define U8_INV(a)						(u8)(~a)
	#define U16_INV(a)						(u16)(~a)
	#define U32_INV(a)						(u32)(~a)
#endif
/*****************************************************************************************************************************/

/********************************************************特殊运算*************************************************************/
/*****************************************************************************************************************************/
#if BOOT__CODE_CHECK__FOR_TEST

#else
	#define ABS(a)							abs(a)
#endif
/*****************************************************************************************************************************/
/*****************************************************************************************************************************/

/********************************************************有符号运算(只用在字节码解释上)*****************************************/
/*****************************************************************************************************************************/
#if BOOT__CODE_CHECK__FOR_TEST
	extern s16 S16_A_S8(s16 a, s8 b);
	extern s32 S32_A_S8(s32 a, s8 b);
	extern s32 S32_A_S16(s32 a, s16 b);

	extern s8 S8_S_S8(s8 a, s8 b);
	extern s16 S16_S_S8(s16 a, s8 b);
	extern s16 S16_S_S16(s16 a, s16 b);
	extern s16 S16_DEC(s16 a);
	extern s32 S32_S_S32(s32 a, s32 b);


	extern s16 S8_M_S16(s8 a, s16 b);
	extern s32 S8_M_S32(s8 a, s32 b);
	extern s16 S16_D_S16(s16 a, s16 b);
	extern s32 S32_D_S32(s32 a, s32 b);

	extern s16 S16_R_S16(s16 a, s16 b);
	extern s32 S32_R_S32(s32 a, s32 b);

	extern PF8 PF8_A_S16(PF8 a, s16 b);
#else
	#define S16_A_S8(a, b)					(s16)((s16)(a) + (s8)(b))
	#define S32_A_S8(a, b)					(s32)((s32)(a) + (s8)(b))
	#define S32_A_S16(a, b)					(s32)((s32)(a) + (s16)(b))

	#define S8_S_S8(a, b)					(s8)((s8)a - (s8)b)
	#define S16_S_S8(a, b)					(s16)((s16)a - (s8)b)
	#define S16_S_S16(a, b)					(s16)((s16)a - (s16)b)
	#define S16_DEC(a)              		(s16)(a --)
	#define S32_S_S32(a, b)					(s32)((s32)a - (s32)b)


	#define S8_M_S16(a,b)           		(s16)((s8)a * (s16)b)
	#define S8_M_S32(a,b)           		(s32)((s8)a * (s32)b)
	#define S16_D_S16(a, b)					((s16)(a) / (s16)(b))
	#define S32_D_S32(a, b)					(s32)((s32)(a) / (s32)(b))

	#define S16_R_S16(a, b)					(s16)((s16)(a) % (s16)(b))
	#define S32_R_S32(a, b)					(s32)((s32)(a) % (s32)(b))

	#define PF8_A_S16(a, b)         		((PF8)a+(s16)b)
#endif
#define S8_INV(a)						(s8)(~a)
#define S16_INV(a)						(s16)(~a)
#define S32_INV(a)						(s32)(~a)
#define S16_SHR_U8(a, b)				(s16)((s16)(a) >> (u8)(b))
/*****************************************************************************************************************************/
/*****************************************************************************************************************************/

/********************************************************数据取反操作**********************************************************/
#define U8_INV(a)						(u8)(~a)
#define U16_INV(a)						(u16)(~a)
#define U32_INV(a)						(u32)(~a)
/*****************************************************************************************************************************/
/********************************************************数据位操作**********************************************************/
#define     ClearBit(a,b)       (a) &= ~(1 << (b))
#define     SetBit(a,b)         (a) |= (1 << (b))
#define     ValueBit(a,b)      (((a) >> (b))&0x01)     //使用该表达式，代码大约减少300bytes
/*****************************************************************************************************************************/
#endif
