#ifndef __ECP_READ_WRITE_H__
#define	__ECP_READ_WRITE_H__

#include <string.h>
#include "ecpDefine.h"

/********************************************************局部变量地址读********************************************************/
/*****************************************************************************************************************************/
#define PD_R_U8(d)							(* (PD8)memoryToPoint((memref)(d)))
#define PD_R_U16(d)							htoj16((* (PD16)memoryToPoint((memref)(d))))
#define PD_R_U32(d)							htoj32((* (PD32)memoryToPoint((memref)(d))))

#define PI_R_U8(d)							(* (PI8)memoryToPoint((memref)(d)))
#define PI_R_U16(d)							htoj16((* (PI16)memoryToPoint((memref)(d))))
#define PI_R_U32(d)							htoj32((* (PI32)memoryToPoint((memref)(d))))

#define PX_R_U8(d)							(* (PX8)memoryToPoint((memref)(d)))
#define PX_R_U16(d)							htoj16((* (PX16)memoryToPoint((memref)(d))))
#define PX_R_U32(d)							htoj32((* (PX32)memoryToPoint((memref)(d))))

#define PR_R_U8(d)							(* (PR8)memoryToPoint((memref)(d)))
#define PR_R_U16(d)							htoj16((* (PR16)memoryToPoint((memref)(d))))
#define PR_R_U32(d)							htoj32((* (PR32)memoryToPoint((memref)(d))))
/*****************************************************************************************************************************/
/*****************************************************************************************************************************/

/********************************************************局部变量地址写********************************************************/
/*****************************************************************************************************************************/
#define PD_W_U8(d, v)						(* (PD8)memoryToPoint((memref)(d)) = v)
#define PD_W_U16(d, v)						(* (PD16)memoryToPoint((memref)(d)) = htoj16(v))
#define PD_W_U32(d, v)						(* (PD32)memoryToPoint((memref)(d)) = htoj32(v))

#define PI_W_U8(d, v)						(* (PI8)memoryToPoint((memref)(d)) = v)
#define PI_W_U16(d, v)						(* (PI16)memoryToPoint((memref)(d)) = htoj16(v))
#define PI_W_U32(d, v)						(* (PI32)memoryToPoint((memref)(d)) = htoj32(v))

#define PX_W_U8(d, v)						(* (PX8)memoryToPoint((memref)(d)) = v)
#define PX_W_U16(d, v)						(* (PX16)memoryToPoint((memref)(d)) = htoj16(v))
#define PX_W_U32(d, v)						(* (PX32)memoryToPoint((memref)(d)) = htoj32(v))
#define PX_W_REF(d, v)						(* ((PX32)d) = v)

#define PR_W_U8(d, v)						(* (PR8)memoryToPoint((memref)(d)) = v)
#define PR_W_U16(d, v)						(* (PR16)memoryToPoint((memref)(d)) = htoj16(v))
#define PR_W_U32(d, v)						(* (PR32)memoryToPoint((memref)(d)) = htoj32(v))
/*****************************************************************************************************************************/
/*****************************************************************************************************************************/

/********************************************************BUFFER的小量读 *******************************************************/
/*****************************************************************************************************************************/
#define PDB_R_U8(d)							(* (PD8)memoryToPoint((memref)(d)))
#define PDB_R_U16(d)						htoj16((* (PD16)memoryToPoint((memref)(d))))
#define PDB_R_U32(d)						htoj32((* (PD32)memoryToPoint((memref)(d))))

#define PIB_R_U8(d)							(* (PI8)memoryToPoint((memref)(d)))
#define PIB_R_U16(d)						htoj16((* (PI16)memoryToPoint((memref)(d))))
#define PIB_R_U32(d)						htoj32((* (PI32)memoryToPoint((memref)(d))))

#define PXB_R_U8(d)							(* (PX8)memoryToPoint((memref)(d)))
#define PXB_R_U16(d)						htoj16((* (PX16)memoryToPoint((memref)(d))))
#define PXB_R_U32(d)						htoj32((* (PX32)memoryToPoint((memref)(d))))

#define PRB_R_U8(d)							(* (PR8)memoryToPoint(d))
#define PRB_R_U16(d)						htoj16((* (PR16)memoryToPoint((memref)(d))))
#define PRB_R_U32(d)						htoj32((* (PR32)memoryToPoint((memref)(d))))
/*****************************************************************************************************************************/
/*****************************************************************************************************************************/

/********************************************************BUFFER的小量写 *******************************************************/
/*****************************************************************************************************************************/
#define PDB_W_U8(d, v)						(* (PD8)memoryToPoint((memref)(d)) = v)
#define PDB_W_U16(d, v)						(* (PD16)memoryToPoint((memref)(d)) = htoj16(v))
#define PDB_W_U32(d, v)						(* (PD32)memoryToPoint((memref)(d)) = htoj32(v))

#define PIB_W_U8(d, v)						(* (PI8)memoryToPoint((memref)(d)) = v)
#define PIB_W_U16(d, v)						(* (PI16)memoryToPoint((memref)(d)) = htoj16(v))
#define PIB_W_U32(d, v)						(* (PI32)memoryToPoint((memref)(d)) = htoj32(v))

#define PXB_W_U8(d, v)						(* (PX8)memoryToPoint((memref)(d)) = v)
#define PXB_W_U16(d, v)						(* (PX16)memoryToPoint((memref)(d)) = htoj16(v))
#define PXB_W_U32(d, v)						(* (PX32)memoryToPoint((memref)(d)) = htoj32(v))

#define PRB_W_U8(d, v)						(* (PR8)memoryToPoint((memref)(d)) = v)
#define PRB_W_U16(d, v)						(* (PR16)memoryToPoint((memref)(d)) = htoj16(v))
#define PRB_W_U32(d, v)						(* (PR32)memoryToPoint((memref)(d)) = htoj32(v))
/*****************************************************************************************************************************/
/*****************************************************************************************************************************/

/********************************************************NVM的小量读（不在缓存）***********************************************/
/*****************************************************************************************************************************/
#define PN_R_U8(d)					 		(* (PN8)memoryToPoint((memref)(d)))
#define PN_R_U16(d)					 		htoj16((* (PN16)memoryToPoint((memref)(d))))
#define PN_R_U24(d)							((* (PN32)memoryToPoint((memref)(d))) & 0x00FFFFFF)
#define PN_R_U32(d)					 		htoj32((* (PN32)memoryToPoint((memref)(d))))
/*****************************************************************************************************************************/
/*****************************************************************************************************************************/

/********************************************************CODE的小量读（不在缓存）**********************************************/
/*****************************************************************************************************************************/
#define PC_R_U8(d)					 		(* (PC8)memoryToPoint((memref)(d)))
#define PC_R_U16(d)					 		htoj16((* (PC16)memoryToPoint((memref)(d))))
#define PC_R_U32(d)					 		htoj32((* (PC32)memoryToPoint((memref)(d))))
/*****************************************************************************************************************************/
/*****************************************************************************************************************************/

/********************************************************FAR的小量读（不在缓存）***********************************************/
/*****************************************************************************************************************************/
#define PF_R_U8(d)					 		(* (PF8)memoryToPoint((memref)(d)))
#define PF_R_U16(d)					 		htoj16((* (PF16)memoryToPoint((memref)(d))))
#define PF_R_U32(d)							htoj32((* (PF32)memoryToPoint((memref)(d))))
/*****************************************************************************************************************************/
/*****************************************************************************************************************************/

/********************************************************MEM的小量读（不在缓存）***********************************************/
/*****************************************************************************************************************************/
#define PM_R_U8(d)					 		(* (PM8)memoryToPoint((memref)(d)))
#define PM_R_U16(d)					 		htoj16((* (PM16)memoryToPoint((memref)(d))))
#define PM_R_U32(d)					 		htoj32((* (PM32)memoryToPoint((memref)(d))))
/*****************************************************************************************************************************/
/*****************************************************************************************************************************/

/********************************************************数据的大量操作（快速非安全）（不在缓存）  *******************************/
/*****************************************************************************************************************************/
#define ecpMem_Copy(d, s, l)				memcpy(memoryToPoint((memref)(d)),memoryToPoint((memref)(s)), l)
#define ecpMem_Move(d, s, l)				memmove(memoryToPoint((memref)(d)), memoryToPoint((memref)(s)), l)
#define ecpMem_Compare(d, s, l)				memcmp(memoryToPoint((memref)(d)),memoryToPoint( (memref)(s)), l)
#define ecpMem_CmpRamVsRom(d, s, l)			memcmp(memoryToPoint((memref)(d)),memoryToPoint((memref)(s)), l)
#define ecpMem_Fill(d, v, l)				memset(memoryToPoint((memref)(d)), v, l)
#define ecpMem_Set(dest, value, length)		memset(memoryToPoint((memref)(dest)), (s8)value, (s32)length)
/*****************************************************************************************************************************/
/*****************************************************************************************************************************/

/*********************************************************代码优化专用********************************************************/
/*****************************************************************************************************************************/
#define PXS_W_U16(d, v)				        (* (PX16)memoryToPoint((memref)(d)) = v)
#define PXS_R_U16(d)				        (* (PX16)memoryToPoint((memref)(d)))
#define PXS_W_U32(d, v)				        (*(PX32)memoryToPoint((memref)(d)) = v)
#define PXS_R_U32(d)				        (* (PX32)memoryToPoint((memref)(d)))
#define checkNullAddrss(address)			(0 == *(u32 *)&address)
/*****************************************************************************************************************************/
/*****************************************************************************************************************************/
/*******************************************************数据的大量操作（安全）（不在缓存）**************************************/
/*****************************************************************************************************************************/

/*****************************************************************************************************************************/
/*****************************************************************************************************************************/
#endif
